InformationRegisters/Renault_НастройкиПоказаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НастройкиПоказаСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СообщенияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СообщенияСотрудникам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработал</Name>
					<Comment>Тот кто обработал сообщение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КогдаОбработано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнитьОдному</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БаннерПоказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Тот кто может получить сообщение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Comment>Дата сообщения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/CRM_Отделы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_Отделы</Name>
			<Comment>Содержит список отделов с указанием входящих в отдел подразделений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПродажаАвтомобилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрендМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентскаяСлужба</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификацияRenault</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_КлассификацияОтделов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьВСписки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПервичныйИнтерес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_СообщенияПользователям/Ext/Module.bsl
//ПолучитьВидыСообщений имеет значения:
//ВидСообщения индивидуальное = Истина
//ВидСообщения не индивидуальное = Ложь
Функция ПолучитьВидыСообщенийИндивидуальныхИНет(ПолучитьВидыСообщений) Экспорт
	Мас=Новый Массив;
	Если ПолучитьВидыСообщений Тогда
		Мас.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_АвтомобильГотовКВыдаче);	
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_ВыданСчет);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосклад_ИзменениеСтатусаЗаявкиНаРезерв);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_КлиентНазначенНаМастера);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_НеявкаНаПриемкуВыдачу);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_КоллизияПланирования);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_МойкаНачата);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_МойкаОкончена);
		Мас.Добавить(Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаVIN);
		Мас.Добавить(Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаКлиента);
		Возврат Мас;
	Иначе
		Мас.Добавить(Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_ВыдачаНачата);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_ВыдачаОкончена);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_КлиентПодъехал);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.ОК_НовыйТрафик);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_КонтрольЗавершен);
		//Мас.Добавить(Справочники.Renault_ВидСообщения.Автосервис_КонтрольНачат);
		Возврат Мас;
	КонецЕсли;	
КонецФункции

Процедура ДобавитьСтрокуТаблНастрПоУмолч(ТаблНастрПоУмолч,ВидСообщения,Отдел=Неопределено,ДилерскийЦентр=Неопределено,Должность=Неопределено,Пользователь=Неопределено)
	
	СтрТЗ=ТаблНастрПоУмолч.Добавить();
	СтрТЗ.ВидСообщения=ВидСообщения;
	СтрТЗ.Отдел=?(Отдел=Неопределено,Справочники.CRM_Отделы.ПустаяСсылка(),Отдел);
	СтрТЗ.ДилерскийЦентр=?(ДилерскийЦентр=Неопределено,Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка(),ДилерскийЦентр);
	СтрТЗ.Должность=?(Должность=Неопределено,Справочники.Должности.ПустаяСсылка(),Должность);
	СтрТЗ.Пользователь=?(Пользователь=Неопределено,Справочники.Пользователи.ПустаяСсылка(),Пользователь);
	
КонецПроцедуры	

Функция ПолучитьТаблицуПоУмолчаниюНастроекСообщенийПользователям() Экспорт
	МасВС=Новый Массив; МасВС.Добавить(Тип("СправочникСсылка.Renault_ВидСообщения"));
	МасО=Новый Массив; МасО.Добавить(Тип("СправочникСсылка.CRM_Отделы"));	
	МасДЦ=Новый Массив; МасДЦ.Добавить(Тип("СправочникСсылка.CRM_ДилерскиеЦентры"));	
	МасД=Новый Массив; МасД.Добавить(Тип("СправочникСсылка.Должности"));
	МасП=Новый Массив; МасП.Добавить(Тип("СправочникСсылка.Пользователи"));
	ТаблНастрПоУмолч=Новый ТаблицаЗначений;
	ТаблНастрПоУмолч.Колонки.Добавить("ВидСообщения",Новый ОписаниеТипов(МасВС));
	ТаблНастрПоУмолч.Колонки.Добавить("Отдел",Новый ОписаниеТипов(МасО));
	ТаблНастрПоУмолч.Колонки.Добавить("ДилерскийЦентр",Новый ОписаниеТипов(МасДЦ));
	ТаблНастрПоУмолч.Колонки.Добавить("Должность",Новый ОписаниеТипов(МасД));
	ТаблНастрПоУмолч.Колонки.Добавить("Пользователь",Новый ОписаниеТипов(МасП));
	//ДобавитьСтрокуТаблНастрПоУмолч(ТаблНастрПоУмолч,Справочники.Renault_ВидСообщения.Автосервис_КлиентПодъехал,,,,ПараметрыСеанса.Пользователь);
	ДобавитьСтрокуТаблНастрПоУмолч(ТаблНастрПоУмолч,Справочники.Renault_ВидСообщения.НовыйКлиентПереданМенеджеру,,,,);
	ДобавитьСтрокуТаблНастрПоУмолч(ТаблНастрПоУмолч,Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаVIN,,,,);
	ДобавитьСтрокуТаблНастрПоУмолч(ТаблНастрПоУмолч,Справочники.Renault_ВидСообщения.Корп_ИзменениеСтатусаЗаявкиНаКлиента,,,,);
	Возврат ТаблНастрПоУмолч;
КонецФункции	

Функция ПолучитьПользователейПолучателейСообщения(ВидСообщения, ДилерскийЦентрИсточникаСообщения)
	Запр=Новый Запрос;
	Запр.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь
	|ИЗ
	|	РегистрСведений.Renault_НастройкиПоказаСообщений КАК Renault_НастройкиПоказаСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|		ПО (ВЫБОР
	|				КОГДА Renault_НастройкиПоказаСообщений.Отдел = &ПустОтдел
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_НастройкиПоказаСообщений.Отдел = Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.Отдел
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Renault_НастройкиПоказаСообщений.ДилерскийЦентр = &ПустДЦ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_НастройкиПоказаСообщений.ДилерскийЦентр = Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Renault_НастройкиПоказаСообщений.Должность = &ПустДолжность
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_НастройкиПоказаСообщений.Должность = Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник.Должность
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА Renault_НастройкиПоказаСообщений.Пользователь = &ПустПользователь
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_НастройкиПоказаСообщений.Пользователь = Renault_ПользователиИШаблоныПравИНастроек.Пользователь
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &ДилерскийЦентрИсточникаСообщения = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр = &ДилерскийЦентрИсточникаСообщения
	|			КОНЕЦ)
	|ГДЕ
	|	Renault_НастройкиПоказаСообщений.ВидСообщения = &ВидСообщения";
	Запр.УстановитьПараметр("ПустОтдел",Справочники.CRM_Отделы.ПустаяСсылка());
	Запр.УстановитьПараметр("ПустДЦ",Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка());
	Запр.УстановитьПараметр("ПустДолжность",Справочники.Должности.ПустаяСсылка());
	Запр.УстановитьПараметр("ПустПользователь",Справочники.Пользователи.ПустаяСсылка());
	Запр.УстановитьПараметр("ВидСообщения",ВидСообщения);
	Запр.УстановитьПараметр("ДилерскийЦентрИсточникаСообщения", ДилерскийЦентрИсточникаСообщения);
	Возврат Запр.Выполнить().Выгрузить();
КонецФункции

Функция УИДОбъектаОтправителяОткрыт(ВидСообщения,УИДОбъектаОтправителя)
	
	Запр=Новый Запрос;
	Запр.Текст=
	"ВЫБРАТЬ
	|	Renault_СообщенияСотрудникам.УИД
	|ИЗ
	|	РегистрСведений.Renault_СообщенияСотрудникам КАК Renault_СообщенияСотрудникам
	|ГДЕ
	|	Renault_СообщенияСотрудникам.ВидСообщения = &ВидСообщения
	|	И Renault_СообщенияСотрудникам.УИД = &УИДОбъектаОтправителя
	|	И Renault_СообщенияСотрудникам.Обработал = &ПустПользователь";
	Запр.УстановитьПараметр("ВидСообщения",ВидСообщения);
	Запр.УстановитьПараметр("УИДОбъектаОтправителя", УИДОбъектаОтправителя);
	Запр.УстановитьПараметр("ПустПользователь",Справочники.Пользователи.ПустаяСсылка());
	ТЗ=Запр.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Функция ПослатьСообщение(ВидСообщения, ВыполнитьТолькоОдному, ТекстСообщения, УИДОбъектаОтправителя = Неопределено, ДилерскийЦентрИсточникаСообщения = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	ТЗ = ПолучитьПользователейПолучателейСообщения(ВидСообщения, ДилерскийЦентрИсточникаСообщения);
	
	Если Не ЗначениеЗаполнено(УИДОбъектаОтправителя) Тогда
		УИД = Строка(Новый УникальныйИдентификатор());
	ИначеЕсли УИДОбъектаОтправителяОткрыт(ВидСообщения, УИДОбъектаОтправителя) Тогда
		Возврат Ложь;
	Иначе
		УИД = УИДОбъектаОтправителя;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для Каждого СтрТЗ Из ТЗ Цикл
		
		РСЗ = РегистрыСведений.Renault_СообщенияСотрудникам.СоздатьМенеджерЗаписи();
		РСЗ.ДатаСобытия = ТекущаяДата();
		РСЗ.ВидСообщения = ВидСообщения;
		РСЗ.УИД = УИД;		
		РСЗ.Отправитель = ТекПользователь;
		РСЗ.Получатель = СтрТЗ.Пользователь;
		РСЗ.ВыполнитьОдному = ВыполнитьТолькоОдному;
		РСЗ.ТекстСообщения = ТекстСообщения;
		Попытка
			РСЗ.Записать();
		Исключение
			Отказ = Истина;
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция МожноОтправитьСообщение(ВидСообщения)
	Мас=ПолучитьВидыСообщенийИндивидуальныхИНет(Истина);
	Если Мас.Найти(ВидСообщения)=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	Запр=Новый Запрос;
	Запр.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь
	|ИЗ
	|	РегистрСведений.Renault_НастройкиПоказаСообщений КАК Renault_НастройкиПоказаСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
	|		ПО (ВЫБОР
	|				КОГДА Renault_НастройкиПоказаСообщений.ДилерскийЦентр = &ПустДЦ
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Renault_НастройкиПоказаСообщений.ДилерскийЦентр = Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки.ДилерскийЦентр
	|			КОНЕЦ)
	|ГДЕ
	|	Renault_НастройкиПоказаСообщений.ВидСообщения = &ВидСообщения";
	Запр.УстановитьПараметр("ВидСообщения",ВидСообщения);
	Запр.УстановитьПараметр("ПустДЦ",Справочники.CRM_ДилерскиеЦентры.ПустаяСсылка());
	ТЗ=Запр.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ПослатьСообщениеПользователю(Знач ВидСообщения, Знач ПользовательПолучатель, ТекстСообщения, УИДОбъектаОтправителя = Неопределено) Экспорт
	
	Если Не ТипЗнч(УИДОбъектаОтправителя) = Тип("Строка") Тогда
		УИДОбъектаОтправителя = Строка(УИДОбъектаОтправителя);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидСообщения) Тогда
		Возврат Ложь;
	ИначеЕсли НЕ МожноОтправитьСообщение(ВидСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ПользовательПолучатель) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Если Не ЗначениеЗаполнено(ПользовательПолучатель) Тогда
			ПользовательПолучатель = Неопределено;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Пользователи.Ссылка
		               |ИЗ
		               |	Справочник.Пользователи КАК Пользователи
		               |ГДЕ
		               |	Пользователи.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", ПользовательПолучатель);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПользовательПолучатель = Выборка.Ссылка;
		Иначе
			ПользовательПолучатель = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекПользователь=ПараметрыСеанса.Пользователь;
	Если УИДОбъектаОтправителя=Неопределено Тогда
		УИД=Новый УникальныйИдентификатор();
	ИначеЕсли УИДОбъектаОтправителяОткрыт(ВидСообщения,УИДОбъектаОтправителя) Тогда
		Возврат Ложь;
	Иначе
		УИД=УИДОбъектаОтправителя;	
	КонецЕсли;		
	РСЗ=РегистрыСведений.Renault_СообщенияСотрудникам.СоздатьМенеджерЗаписи();
	РСЗ.ДатаСобытия=ТекущаяДата();
	РСЗ.ВидСообщения=ВидСообщения;
	РСЗ.УИД=УИД;	
	РСЗ.Отправитель=ТекПользователь;
	РСЗ.Получатель=ПользовательПолучатель;
	РСЗ.ВыполнитьОдному=Истина;
	РСЗ.ТекстСообщения=ТекстСообщения;
	Попытка
		РСЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;	
	Возврат Истина;
КонецФункции

Функция УдалитьСообщение(УИДОбъектаОтправителя,ВидСообщения=Неопределено) Экспорт
	
	Если ТипЗнч(УИДОбъектаОтправителя) <> Тип("Строка") Тогда
		УИДОбъектаОтправителя = Строка(УИДОбъектаОтправителя);
	КонецЕсли;
	
	Запр=Новый Запрос;
	Запр.Текст=
	"ВЫБРАТЬ
	|	Renault_СообщенияСотрудникам.УИД,
	|	Renault_СообщенияСотрудникам.ДатаСобытия
	|ИЗ
	|	РегистрСведений.Renault_СообщенияСотрудникам КАК Renault_СообщенияСотрудникам
	|ГДЕ
	|	Renault_СообщенияСотрудникам.УИД = &УИД
	|	И Renault_СообщенияСотрудникам.Обработал = &ПустПользователь
	|	И ВЫБОР
	|			КОГДА &ВидСообщения = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_СообщенияСотрудникам.ВидСообщения = &ВидСообщения
	|		КОНЕЦ";
	Запр.УстановитьПараметр("УИД",УИДОбъектаОтправителя);
	Запр.УстановитьПараметр("ВидСообщения",ВидСообщения);
	Запр.УстановитьПараметр("ПустПользователь",Справочники.Пользователи.ПустаяСсылка());
	ТЗ=Запр.Выполнить().Выгрузить();
	Если ТЗ.Количество()=0 Тогда
		Возврат Ложь;		
	КонецЕсли;
	Возврат ИзменитьРегСвед("Renault_СообщенияСотрудникам"
	,Новый Структура("УИД,ДатаСобытия",УИДОбъектаОтправителя,ТЗ[0].ДатаСобытия)
	,Новый Структура("Обработал,КогдаОбработано",ПараметрыСеанса.Пользователь,ТекущаяДата()));	
КонецФункции

//Меняет по указанным измерениям ресурсы регистра сведений. Указываюся только те ключи структур,
//по которым идет отбор и меняются данные.
//СтруктРесурсы может быть Неопределено, тогда значения набора удаляеются
Функция ИзменитьРегСвед(ИмяРегСвед,СтруктИзмерения,СтруктРесурсы) Экспорт
	РСНЗ=РегистрыСведений[ИмяРегСвед].СоздатьНаборЗаписей();
	Для Каждого ЭлСтрукт Из СтруктИзмерения Цикл
		ЭО=РСНЗ.Отбор.Найти(ЭлСтрукт.Ключ);	
		ЭО.ВидСравнения=ВидСравнения.Равно;
		ЭО.Использование=Истина;
		ЭО.Значение=ЭлСтрукт.Значение;
	КонецЦикла;
	РСНЗ.Прочитать();
	
	Если СтруктРесурсы=Неопределено Тогда
		РСНЗ.Очистить();
	Иначе
		Для Каждого РСЗ Из РСНЗ Цикл
			Для Каждого ЭлСтрукт Из СтруктРесурсы Цикл
				РСЗ[ЭлСтрукт.Ключ]=ЭлСтрукт.Значение;				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Попытка
		РСНЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции	

#Если Клиент Тогда
Процедура ПоказатьБаннер(ТекстСообщения,СтруктИзмер)	Экспорт
	Если глРарус_Компонента<>Неопределено Тогда
		Тема = обОбрезатьСтроку(Формат(СтруктИзмер.ДатаСобытия,"ДФ='дд.ММ.гг ЧЧ:мм'")+" "+СтруктИзмер.ВидСообщения, 62, "…");
		ТелоСообщения = обОбрезатьСтроку(ТекстСообщения,88,"…") + " <BR>";
		глРарус_Компонента.ПоказатьБаннер("Новое сообщение", Тема, ТелоСообщения, 3, 0, Ложь, "Баннер", Истина);
		Renault_СообщенияПользователям.ИзменитьРегСвед("Renault_СообщенияСотрудникам",СтруктИзмер
			,Новый Структура("БаннерПоказан",Истина));
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
